constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       4274;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       4294;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          110;
        startFace       4314;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          4400;
        startFace       4424;
    }
    sym
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          110;
        startFace       8824;
    }
    slave
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          15;
        startFace       8934;
    }
)

// ************************************************************************* //
