system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;
//startFrom       latestTime;

startTime       0;

stopAt          endTime;

//stopAt          writeNow;

endTime         1;

deltaT          0.0002;

//writeControl    timeStep;

//writeInterval   1;

//writeControl    runTime; 
writeControl    adjustableRunTime; 

writeInterval   0.02;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

//add to adjust the time step in calculation
adjustTimeStep  yes;                      //
maxCo           1;                        //
maxDeltaT       0.0001;                   //
////////////////////////////////////////////


// ************************************************************************* //
functions
{
 /*   cellMin
    {
        #includeEtc "caseDicts/postProcessing/minMax/cellMin.cfg"
        enabled 	    true; 	//true or false
        log             true;	//write to screen
        fields  (p);
    } */

//    #includeFunc probes
    
//      #includeFunc graphUniform
//      #includeFunc mag(U)
        #includeFunc residuals

};
